sphere-buoyantSimpleFoam/0_orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{

    xmin
    {
        type            freestream;
        freestreamValue $internalField;
    }
    xmax
    {
        type            freestream;
        freestreamValue $internalField;
    }
    ymin
    {
        type            freestream;
        freestreamValue $internalField;
    }
    ymax
    {
        type            freestream;
        freestreamValue $internalField;
    }
    zmin
    {
        type            freestream;
        freestreamValue $internalField;
    }
    zmax
    {
        type            freestream;
        freestreamValue $internalField;
    }
    sphere
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
