sphere-buoyantSimpleFoam/0_orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{

    xmin
    {
        type            calculated;
        value           uniform 0;
    }
    xmax
    {
        type            calculated;
        value           uniform 0;
    }
    ymin
    {
        type            calculated;
        value           uniform 0;
    }
    ymax
    {
        type            calculated;
        value           uniform 0;
    }
    zmin
    {
        type            calculated;
        value           uniform 0;
    }
    zmax
    {
        type            calculated;
        value           uniform 0;
    }

    sphere
    {
        type            compressible::alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }

}
// ************************************************************************* //
