sphere-buoyantSimpleFoam/0_orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions     [1 -1 -2 0 0 0 0];

internalField  uniform 101325;

boundaryField
{

    xmin
    {
        type            calculated;
        value           $internalField;
    }
    xmax
    {
        type            calculated;
        value           $internalField;
    }
    ymin
    {
        type            calculated;
        value           $internalField;
    }
    ymax
    {
        type            calculated;
        value           $internalField;
    }
    zmin
    {
        type            calculated;
        value           $internalField;
    }
    zmax
    {
        type            calculated;
        value           $internalField;
    }
    sphere
    {
        type            calculated;
        value           $internalField;
    }


}

// ************************************************************************* //
